Tekla Open API Reference for Tekla Structures 2025
ComponentItem.AttributeFileExtension Property
 Gets the attribute file extension of item from the component database.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string AttributeFileExtension { get; }
Public ReadOnly Property AttributeFileExtension As String
	Get
Return Value
Type: String
File extension on success, empty string if not found.
See Also
Reference
ComponentItem Class
Tekla.Structures.Catalogs Namespace